In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('tested.csv')

In [5]:
df_phase_1 = df

In [6]:
df_phase_1.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [7]:
unique_passengers = df_phase_1.drop_duplicates(subset = ['Name'])

In [8]:
mean_age = unique_passengers['Age'].mean(numeric_only=True)
mean_fare = unique_passengers['Fare'].mean(numeric_only=True)
median_age = unique_passengers['Age'].median(numeric_only=True)
median_fare = unique_passengers['Fare'].median(numeric_only=True)

In [9]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
unique_passengers.loc[unique_passengers['Sex'] == 'male', 'Sex'] = 0
unique_passengers.loc[unique_passengers['Sex'] == "female" , 'Sex'] = 1

In [11]:
unique_passengers

     PassengerId  Survived  Pclass  ...      Fare Cabin  Embarked
0            892         0       3  ...    7.8292   NaN         Q
1            893         1       3  ...    7.0000   NaN         S
2            894         0       2  ...    9.6875   NaN         Q
3            895         0       3  ...    8.6625   NaN         S
4            896         1       3  ...   12.2875   NaN         S
..           ...       ...     ...  ...       ...   ...       ...
413         1305         0       3  ...    8.0500   NaN         S
414         1306         1       1  ...  108.9000  C105         C
415         1307         0       3  ...    7.2500   NaN         S
416         1308         0       3  ...    8.0500   NaN         S
417         1309         0       3  ...   22.3583   NaN         C

[418 rows x 12 columns]

In [12]:
unique_passengers['Embarked'] = unique_passengers['Embarked'].map({'Q' : 1, 'S' : 2, 'C' : 3})

I changed the embarkation station to numerical data

In [13]:
unique_passengers.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         1
1          893         1       3  ...   7.0000   NaN         2
2          894         0       2  ...   9.6875   NaN         1
3          895         0       3  ...   8.6625   NaN         2
4          896         1       3  ...  12.2875   NaN         2

[5 rows x 12 columns]

In [14]:
survivors = (unique_passengers['Survived'] == 1).sum()
total = 418

total

418

In [15]:
percentage_survived =  (f"{(survivors/total) * 100}" + '%')

print(percentage_survived)

36.36363636363637%

In [16]:
grouped_by_gender = unique_passengers.groupby(['Sex'])
grouped_by_gender.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         1
1          893         1       3  ...   7.0000   NaN         2
2          894         0       2  ...   9.6875   NaN         1
3          895         0       3  ...   8.6625   NaN         2
4          896         1       3  ...  12.2875   NaN         2
6          898         1       3  ...   7.6292   NaN         1

[6 rows x 12 columns]

In [17]:
survival_rates = unique_passengers.groupby('Sex')['Survived'].mean()
print(survival_rates)

Sex
0    0.0
1    1.0
Name: Survived, dtype: float64

In [18]:
survival_rates_by_class = unique_passengers.groupby('Pclass')['Survived'].mean()
survival_rates_by_class

Pclass
1    0.467290
2    0.322581
3    0.330275
Name: Survived, dtype: float64

From above, we can see that only women survived, and if anything all the women survived. 47% of the women were in cabin 1

In [19]:
print(unique_passengers[['Age', 'Survived']].corr())

               Age  Survived
Age       1.000000 -0.000013
Survived -0.000013  1.000000

This shows very little correlation between age and survival.

In [20]:
unique_passengers.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [21]:
unique_passengers['Age'] = unique_passengers['Age'].fillna(mean_age)
unique_passengers = unique_passengers.drop(columns=['PassengerId', 'Pclass', 'Name', 'Cabin', 'Fare', 'Ticket'])

unique_passengers.head(3)

   Survived Sex   Age  SibSp  Parch  Embarked
0         0   0  34.5      0      0         1
1         1   1  47.0      1      0         2
2         0   0  62.0      0      0         1

In [22]:
unique_passengers

x = unique_passengers.drop(columns = ['Survived'])
y = unique_passengers['Survived']

In [23]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
x_scaled = scaler.fit_transform(x)

In [24]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y, test_size = 0.3, random_state= 42)

In [25]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import accuracy_score, confusion_matrix, classification_report

Mod = KNeighborsClassifier(n_neighbors= 3)

Mod.fit(x_train, y_train)

y_pred = Mod.predict(x_test)

print("Accuracy: ", accuracy_score(y_test, y_pred))
print("Classification Report: \n", classification_report(y_test, y_pred))
print("Confusion Matrix: \n", confusion_matrix(y_test, y_pred) )

Accuracy:  0.873015873015873
Classification Report:
               precision    recall  f1-score   support

           0       0.87      0.95      0.91        85
           1       0.88      0.71      0.78        41

    accuracy                           0.87       126
   macro avg       0.87      0.83      0.85       126
weighted avg       0.87      0.87      0.87       126

Confusion Matrix:
 [[81  4]
 [12 29]]